# объявление функции
def number_to_words(num):
    list = ['', "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать"]
    list2 = ['двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    if num in range(1, 20):
        return list[num]
    if num in range(20, 100):
        firstnum = num // 10
        secondnum = num % 10
        return list2[firstnum-2] + ' ' + list[secondnum]
# считываем данные
n = int(input())

# вызываем функцию
print(number_to_words(n))